# **Customer Analysis Case Study**

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import statsmodels.api as sm
from scipy.stats import boxcox
pd.options.display.max_rows = 100
## Install xlrd package to load Excel files
#!conda install openpyxl
#!conda install xlrd

# Data cleaning

### Loading data

In [2]:
file1 = pd.read_csv('Data/file1.csv')
file2 = pd.read_csv('Data/file2.csv')
file3 = pd.read_csv('Data/file3.csv')

### Standardizing header names

In [3]:
# Printing column files
print(file1.columns)
print(file2.columns)
print(file3.columns)

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')
Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')
Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [4]:
# Changing column name GENDER to Gender
file1.rename(columns={'ST':'State','GENDER':'Gender'}, inplace = True)
print(file1.columns)
file2.rename(columns={'ST':'State','GENDER':'Gender'}, inplace = True)
print(file2.columns)

Index(['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')
Index(['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

## Creating Data Frame

In [5]:
# Concatenating files in to one
df=pd.concat([file1,file2,file3], axis=0)
# Reseting index
df=df.reset_index(drop=True) 
df

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
12070,PK87824,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
12071,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
12072,UP19263,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
12073,Y167826,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

## Removing duplicates and unnecessary columns

In [6]:
df.drop_duplicates(inplace=True,ignore_index=True) #ignore_index=True restes index
df

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
9130,LA72316,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
9131,PK87824,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
9132,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
9133,UP19263,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
9134,Y167826,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

### Customer column

In [7]:
df["Customer"].value_counts()

XY33610    2
QK69627    2
QA49556    2
SP81997    2
XZ34917    2
          ..
TN66124    1
JV99867    1
YK92213    1
FR81224    1
Y167826    1
Name: Customer, Length: 9056, dtype: int64

In [8]:
df.loc[df["Customer"] == 'QK69627' ]

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
1686,QK69627,Washington,F,High School or Below,938816.29%,75264.0,78.0,1/0/00,Personal Auto,Four-Door Car,343.340301
3180,QK69627,Washington,F,High School or Below,9388.162927,75264.0,78.0,0,Personal Auto,Four-Door Car,343.340301

**Some 'Customer' column  values have more than one register per customer but they seem to be duplicate values**

In [9]:
# Remove 'Customer' column
df.drop(columns="Customer", inplace=True) 
df

,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...
9130,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
9131,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
9132,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
9133,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
9134,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

### Header names to lower case

In [10]:
def lower_case_column_names(df): #function to change columns to lower case
    df.columns=[i.lower() for i in df.columns] #list comprenhension
    return df

In [11]:
df=lower_case_column_names(df) # Call function 
df.head()

,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Veryfing Columns data types

In [12]:
df.info() #Get Data Frame info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9135 entries, 0 to 9134
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9134 non-null   object
 1   gender                     9012 non-null   object
 2   education                  9134 non-null   object
 3   customer lifetime value    9127 non-null   object
 4   income                     9134 non-null   float64
 5   monthly premium auto       9134 non-null   float64
 6   number of open complaints  9134 non-null   object
 7   policy type                9134 non-null   object
 8   vehicle class              9134 non-null   object
 9   total claim amount         9134 non-null   float64
dtypes: float64(3), object(7)
memory usage: 713.8+ KB

 **Customer Lifetime Value and Number of Open Complaints column type should not be object**

### Change "customer lifetime value" column data type

In [13]:
df["customer lifetime value"]

0               NaN
1        697953.59%
2       1288743.17%
3        764586.18%
4        536307.65%
           ...
9130    23405.98798
9131    3096.511217
9132    8163.890428
9133    7524.442436
9134    2611.836866
Name: customer lifetime value, Length: 9135, dtype: object

In [14]:
# Remove '%' and divide by 100 only strings
df["customer lifetime value"] = \
df["customer lifetime value"].apply(lambda x : (pd.to_numeric(x.replace('%',"")))/100 if type(x)==str else x)

In [15]:
df["customer lifetime value"]

0                NaN
1        6979.535900
2       12887.431700
3        7645.861800
4        5363.076500
            ...
9130    23405.987980
9131     3096.511217
9132     8163.890428
9133     7524.442436
9134     2611.836866
Name: customer lifetime value, Length: 9135, dtype: float64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9135 entries, 0 to 9134
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9134 non-null   object
 1   gender                     9012 non-null   object
 2   education                  9134 non-null   object
 3   customer lifetime value    9127 non-null   float64
 4   income                     9134 non-null   float64
 5   monthly premium auto       9134 non-null   float64
 6   number of open complaints  9134 non-null   object
 7   policy type                9134 non-null   object
 8   vehicle class              9134 non-null   object
 9   total claim amount         9134 non-null   float64
dtypes: float64(4), object(6)
memory usage: 713.8+ KB

In [17]:
# customer life time value column Data type is now float

In [18]:
(df.isna().sum()/len(df))*100 #to get % of NaN

state                        0.010947
gender                       1.346470
education                    0.010947
customer lifetime value      0.087575
income                       0.010947
monthly premium auto         0.010947
number of open complaints    0.010947
policy type                  0.010947
vehicle class                0.010947
total claim amount           0.010947
dtype: float64

### Change "number of open complaints" column data type

In [19]:
# Get a summary of 'number of open complaints' column
df['number of open complaints'].value_counts()

0         5629
1/0/00    1623
1          765
2          283
1/1/00     247
3          230
4          119
1/2/00      93
1/3/00      60
5           44
1/4/00      29
1/5/00      12
Name: number of open complaints, dtype: int64

In [20]:
# 1/x/00 should be x complaints

In [21]:
# Get [2] value of string values with leng > 1
df["number of open complaints"] =\
df["number of open complaints"].apply(lambda x: int(x[2]) if type(x)==str and len(x)>1 else x)

In [22]:
df['number of open complaints'].value_counts()

0.0    7252
1.0    1012
2.0     376
3.0     290
4.0     148
5.0      56
Name: number of open complaints, dtype: int64

In [23]:
# 'number of complaints'  data type column is now int and there are no longer 1/x/00

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9135 entries, 0 to 9134
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9134 non-null   object
 1   gender                     9012 non-null   object
 2   education                  9134 non-null   object
 3   customer lifetime value    9127 non-null   float64
 4   income                     9134 non-null   float64
 5   monthly premium auto       9134 non-null   float64
 6   number of open complaints  9134 non-null   float64
 7   policy type                9134 non-null   object
 8   vehicle class              9134 non-null   object
 9   total claim amount         9134 non-null   float64
dtypes: float64(5), object(5)
memory usage: 713.8+ KB

In [25]:
# All data type columns are correct now

## Filtering data and Correcting typos

### 'state' column

In [26]:
df['state'].value_counts()

California    3030
Oregon        2601
Arizona       1629
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: state, dtype: int64

In [27]:
# funtion to change typos to correct names
def typos(x):
    if x in ['Cali']:
        return 'California'
    elif x in ['AZ']:
        return 'Arizona'
    elif x in ['WA']:
        return 'Washington'
    else:
        return x

In [28]:
# Maping function to 'state' column
df['state'] = list(map(typos, df['state']))

In [29]:
df['state'].value_counts()

California    3150
Oregon        2601
Arizona       1703
Nevada         882
Washington     798
Name: state, dtype: int64

In [30]:
# No more typos in  'state' column

### 'gender' column

In [31]:
# get summary of 'gender' column
df['gender'].value_counts()

F         4557
M         4368
Male        40
female      30
Femal       17
Name: gender, dtype: int64

# Replace typos of 'gender' column

In [32]:
df['gender'] = df['gender'].replace(['Male'], 'M')
df['gender'] = df['gender'].replace(['female', 'Femal'], 'F')
df['gender'].value_counts()

F    4604
M    4408
Name: gender, dtype: int64

In [33]:
df['gender'].isna().sum()

123

## Replacing null values for numerical columns

In [34]:
# Create a list of numerical columns 
#numerical_columns = ['customer lifetime value','income','monthly premium auto','number of open complaints','total claim amount']
numerical_columns = df.select_dtypes(include=np.number).columns

In [35]:
df[numerical_columns].isna().sum()

customer lifetime value      8
income                       1
monthly premium auto         1
number of open complaints    1
total claim amount           1
dtype: int64

In [36]:
# function to replace null values with means
def mean_replace(column):
    mean_value = np.mean(df[column]) #create a variable with the mean of that column
    df[column] = df[column].fillna(mean_value) #replacing the null values with the mean

In [37]:
# loop to run mean_replace function in all numerical columns
for col in numerical_columns:   
    mean_replace(col)

In [38]:
df[numerical_columns].isna().sum()

customer lifetime value      0
income                       0
monthly premium auto         0
number of open complaints    0
total claim amount           0
dtype: int64

**'inciome' column 0's should be also treated as null values**

In [39]:
df.head()

,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,Washington,NaN,Master,7977.832132,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,6979.535900,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,12887.431700,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,7645.861800,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,5363.076500,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

In [40]:
# Converting to 0 to nulls
df['income']= [x if x!=0 else None for x in df['income']]
df.head()

,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,Washington,NaN,Master,7977.832132,NaN,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,6979.535900,NaN,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,12887.431700,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,7645.861800,NaN,106.0,0.0,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,5363.076500,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

In [41]:
# filling null values of 'income' column with mean
mean_value = np.mean(df['income'])
df['income'] = df['income'].fillna(mean_value)

In [42]:
df.head()

,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,Washington,NaN,Master,7977.832132,50508.694321,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,6979.535900,50508.694321,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,12887.431700,48767.000000,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,7645.861800,50508.694321,106.0,0.0,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,5363.076500,36357.000000,68.0,0.0,Personal Auto,Four-Door Car,17.269323

## Bucketing the data - Write a function to replace column "State" to different zones. California as West Region, Oregon as North West, and Washington as East, and Arizona and Nevada as Central

In [43]:
# Crate a dictionary with the states zone
State_dic = {'California':'West Region','Oregon':'North West','Washington':'East','Arizona':'Central','Nevada':'Central'}
State_dic

{'California': 'West Region',
 'Oregon': 'North West',
 'Washington': 'East',
 'Arizona': 'Central',
 'Nevada': 'Central'}

In [44]:
df['state']= df['state'].replace(State_dic) # Replace 'state' values with dictionary
df['state'].value_counts()

West Region    3150
North West     2601
Central        2585
East            798
Name: state, dtype: int64

## (Optional) In the column `Vehicle Class`, nerge the two categories `Luxury SUV` and `Luxury Car` into one category named `Luxury Vehicle

In [45]:
df['vehicle class'].value_counts()

Four-Door Car    4640
Two-Door Car     1895
SUV              1773
Sports Car        483
Luxury SUV        182
Luxury Car        161
Name: vehicle class, dtype: int64

In [46]:
df['vehicle class'] = df['vehicle class'].replace(['Luxury SUV','Luxury Car'],'Luxury Vehicle')

In [48]:
df['vehicle class'].value_counts()

Four-Door Car     4640
Two-Door Car      1895
SUV               1773
Sports Car         483
Luxury Vehicle     343
Name: vehicle class, dtype: int64

## - (Optional) Removing outliers using 1.5*IQR technique for all numerical columns.

In [49]:
import matplotlib.pyplot as plt
%matplotlib inline

In [50]:
# function to get IQR of a column
def out_iqr(column):
    df.sort_values(column)
    Q1 = df[column].quantile([.25]) # get 1st quartile
    Q3 = df[column].quantile([.75]) # get 2nd quartile
    IQR = np.array(Q3) - np.array(Q1) # get IQR
    lower_range = int((np.array(Q1)) - (1.5 * IQR)) #lower range
    upper_range = int((np.array(Q3)) + (1.5 * IQR)) #upper range
    return lower_range ,upper_range

In [51]:
out_iqr('income') #will retunr 2 values

(-7775, 104578)

def outlier_treatment(col):
    sorted(col)
    Q1,Q3 = np.percentile(col, [25,75])
    IQR = Q3 - Q1
    lower_range = Q1 - (1.5 * IQR)
    lower_range
    upper_range = Q3 + (1.5 * IQR)
    return lower_range,upper_range

In [52]:
# loop to run out_iqr function in all numerical columns
for col in numerical_columns: #numerical_columns previusly defined
    lowerbound,upperbound = out_iqr(col) # get IQR bouns of a column with out_iqr function
    outliers = df[col][(df[col] < lowerbound)|(df[col]>upperbound)] # defining outliers
    print(col,":",len(outliers),"outliers")
    df.loc[:,[col]]= df[col].drop(outliers.index) # removing outliers from column
    df=df.dropna()

customer lifetime value : 817 outliers
income : 0 outliers
monthly premium auto : 310 outliers
number of open complaints : 1616 outliers
total claim amount : 166 outliers

C:\Users\javie\anaconda3\lib\site-packages\pandas\core\indexing.py:1773: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6112 entries, 2 to 9134
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      6112 non-null   object
 1   gender                     6112 non-null   object
 2   education                  6112 non-null   object
 3   customer lifetime value    6112 non-null   float64
 4   income                     6112 non-null   float64
 5   monthly premium auto       6112 non-null   float64
 6   number of open complaints  6112 non-null   float64
 7   policy type                6112 non-null   object
 8   vehicle class              6112 non-null   object
 9   total claim amount         6112 non-null   float64
dtypes: float64(5), object(5)
memory usage: 525.2+ KB

In [55]:
df=df.reset_index(drop=True) 
df

,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,Central,F,Bachelor,12887.431700,48767.000000,108.0,0.0,Personal Auto,Two-Door Car,566.472247
1,West Region,M,Bachelor,7645.861800,50508.694321,106.0,0.0,Corporate Auto,SUV,529.881344
2,East,M,High School or Below,5363.076500,36357.000000,68.0,0.0,Personal Auto,Four-Door Car,17.269323
3,North West,F,Bachelor,8256.297800,62902.000000,69.0,0.0,Personal Auto,Two-Door Car,159.383042
4,North West,F,College,5380.898600,55350.000000,67.0,0.0,Corporate Auto,Four-Door Car,321.600000
...,...,...,...,...,...,...,...,...,...,...
6107,West Region,M,College,5032.165498,66367.000000,64.0,0.0,Personal Auto,Two-Door Car,307.200000
6108,West Region,F,College,4100.398533,47761.000000,104.0,0.0,Personal Auto,Four-Door Car,541.282007
6109,West Region,F,College,3096.511217,21604.000000,79.0,0.0,Corporate Auto,Four-Door Car,379.200000
6110,West Region,M,College,7524.442436,21941.000000,96.0,0.0,Personal Auto,Four-Door Car,691.200000
6111,West Region,M,College,2611.836866,50508.694321,77.0,0.0,Corporate Auto,Two-Door Car,369.600000

### Standardize 'education' column

In [56]:
df['education'].value_counts()

College                 1813
Bachelor                1798
High School or Below    1731
Master                   508
Doctor                   246
Bachelors                 16
Name: education, dtype: int64

In [57]:
df['education'] = df['education'].replace('Bachelors','Bachelor')
df['education'].value_counts()

Bachelor                1814
College                 1813
High School or Below    1731
Master                   508
Doctor                   246
Name: education, dtype: int64